# Electrical System Neutral Conductors Number Property

Source: https://www.revitapidocs.com/2026/9f62c1f5-a9c9-16ee-e891-81171f131fc7.htm

---

| Electrical System Neutral Conductors Number Property |
| --- |

The NeutralConductors Number of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int NeutralConductorsNumber { get; }
```

```
Public ReadOnly Property NeutralConductorsNumber As Integer
	Get
```

```
public:
property int NeutralConductorsNumber {
	int get ();
}
```

```
member NeutralConductorsNumber : int with get
```

#### Property Value

Int32 Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Remarks This property is used to retrieve the NeutralConductors Number of the Electrical System. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace